CSI API ETABS v1
cPropLink Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cPropLink
Public Interface cPropLink
Dim instance As cPropLink
public interface class cPropLink
type cPropLink =  interface end
The cPropLink type exposes the following members.
Methods
Name | Description
ChangeName
 Changes the name of an existing link property.
Count
 Returns the total number of defined link properties in the model. If desired, counts can be returned for all link properties of a specified type in the model.
Delete
 Deletes a specified link property.
GetAcceptanceCriteria
 Retrieves the acceptance criteria data for a link property
GetDamper
 retrieves link property data for a damper-type link property.
GetDamperBilinear
GetDamperFrictionSpring
GetFrictionIsolator
 Retrieves link property data for a friction isolator-type link property.
GetGap
 Retrieves link property data for a gap-type link property.
GetHook
 Retrieves link property data for a hook-type link property.
GetLinear
 Retrieves link property data for a linear-type link property.
GetMultiLinearElastic
 retrieves link property data for a multilinear elastic-type link property.
GetMultiLinearPlastic
 retrieves link property data for a multilinear plastic-type link property.
GetMultiLinearPoints
 Retrieves the force-deformation data for a specified degree of freedom in multilinear elastic and multilinear plastic link properties.
GetNameList
 Retrieves the names of all defined link properties of the specified type.
GetPDelta
 retrieves P-delta parameters for a link property.
GetPlasticWen
 retrieves link property data for a plastic Wen-type link property.
GetRubberIsolator
 retrieves link property data for a rubber isolator-type link property.
GetSpringData
 retrieves length and area values for a link property that are used if the link property is specified in line and area spring assignments.
GetTCFrictionIsolator
 Retrieves link property data for a T/C friction isolator-type link property.
GetTypeOAPI
 Retrieves the property type for the specified link property.
GetWeightAndMass
 Assigns weight and mass data to a link property.
SetAcceptanceCriteria
 Assigns the acceptance criteria data for a link property
SetDamper
 Initializes a damper-type link property. If this function is called for an existing link property, all items for the property are reset to their default values.
SetDamperBilinear
SetDamperFrictionSpring
SetFrictionIsolator
 Initializes a friction isolator-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetGap
 Initializes a gap-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetHook
 Initializes a hook-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetLinear
 Initializes a linear-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetMultiLinearElastic
 Initializes a multilinear elastic-type link property. If this function is called for an existing link property, all items for the property are reset to their default values.
SetMultiLinearPlastic
 Initializes a multilinear plastic-type link property. If this function is called for an existing link property, all items for the property are reset to their default values.
SetMultiLinearPoints
 Sets the force-deformation data for a specified degree of freedom in multilinear elastic and multilinear plastic link properties.
SetPDelta
 Assigns P-delta parameters to a link property.
SetPlasticWen
 Initializes a plastic Wen-type link property. If this function is called for an existing link property, all items for the property are reset to their default values.
SetRubberIsolator
 Initializes a rubber isolator-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetSpringData
 Assigns length and area values to a link property that are used if the link property is specified in line and area spring assignments.
SetTCFrictionIsolator
 Initializes a T/C friction isolator-type link property. If this function is called for an existing link property, all items for the property are reset to their default value.
SetWeightAndMass
 Retrieves weight and mass data for a link property.
Top
See Also
Reference
ETABSv1 Namespace